espressif/esp-matter/connectedhomeip/connectedhomeip/third_party/openthread/ot-efr32/third_party/silabs/gecko_sdk/platform/service/cpc/inc/sli_cpc_debug.h
/***************************************************************************/ /**
 * @file sli_cpc_debug.h
 * @brief CPC SystemView header file
 *******************************************************************************
 * # License
 * <b>Copyright 2020 Silicon Laboratories Inc. www.silabs.com</b>
 *******************************************************************************
 *
 * SPDX-License-Identifier: Zlib
 *
 * The licensor of this software is Silicon Laboratories Inc.
 *
 * This software is provided 'as-is', without any express or implied
 * warranty. In no event will the authors be held liable for any damages
 * arising from the use of this software.
 *
 * Permission is granted to anyone to use this software for any purpose,
 * including commercial applications, and to alter it and redistribute it
 * freely, subject to the following restrictions:
 *
 * 1. The origin of this software must not be misrepresented; you must not
 *    claim that you wrote the original software. If you use this software
 *    in a product, an acknowledgment in the product documentation would be
 *    appreciated but is not required.
 * 2. Altered source versions must be plainly marked as such, and must not be
 *    misrepresented as being the original software.
 * 3. This notice may not be removed or altered from any source distribution.
 *
 ******************************************************************************/

#ifndef SLI_CPC_DEBUG_H
#define SLI_CPC_DEBUG_H

#include "sl_cpc_config.h"
#include "string.h"

#if (SL_CPC_DEBUG_SYSTEM_VIEW_LOG_CORE_EVENT == 1) \
  || (SL_CPC_DEBUG_SYSTEM_VIEW_LOG_ENDPOINT_EVENT == 1)
#include "SEGGER_SYSVIEW.h"
#endif

#if ((SL_CPC_DEBUG_SYSTEM_VIEW_LOG_CORE_EVENT == 1)     \
  || (SL_CPC_DEBUG_SYSTEM_VIEW_LOG_ENDPOINT_EVENT == 1) \
  || (SL_CPC_DEBUG_CORE_EVENT_COUNTERS == 1)            \
  || (SL_CPC_DEBUG_ENDPOINT_EVENT_COUNTERS == 1))
#define CPC_DEBUG_TRACE
#endif

// Unifed TRACING MACROs
#define SLI_CPC_DEBUG_TRACE_CORE_OPEN_ENDPOINT()                        { SLI_CPC_DEBUG_CORE_COUNTER_INC(endpoint_opened); \
                                                                          SLI_CPC_SYSVIEW_MARK_EVENT_ON_CORE(OPEN_ENDPOINT); }

#define SLI_CPC_DEBUG_TRACE_CORE_CLOSE_ENDPOINT()                       { SLI_CPC_DEBUG_CORE_COUNTER_INC(endpoint_closed); \
                                                                          SLI_CPC_SYSVIEW_MARK_EVENT_ON_CORE(CLOSE_ENDPOINT); }

#define SLI_CPC_DEBUG_TRACE_CORE_RXD_FRAME()                            { SLI_CPC_DEBUG_CORE_COUNTER_INC(rxd_frame); \
                                                                          SLI_CPC_SYSVIEW_MARK_EVENT_ON_CORE(RX_FRAME); }

#define SLI_CPC_DEBUG_TRACE_CORE_RXD_VALID_IFRAME()                      { SLI_CPC_DEBUG_CORE_COUNTER_INC(rxd_valid_iframe); \
                                                                           SLI_CPC_SYSVIEW_MARK_EVENT_ON_CORE(RXD_VALID_IFRAME); }

#define SLI_CPC_DEBUG_TRACE_CORE_RXD_VALID_UFRAME()                      { SLI_CPC_DEBUG_CORE_COUNTER_INC(rxd_valid_uframe); \
                                                                           SLI_CPC_SYSVIEW_MARK_EVENT_ON_CORE(RXD_VALID_UFRAME); }

#define SLI_CPC_DEBUG_TRACE_CORE_RXD_VALID_SFRAME()                      { SLI_CPC_DEBUG_CORE_COUNTER_INC(rxd_valid_sframe); \
                                                                           SLI_CPC_SYSVIEW_MARK_EVENT_ON_CORE(RXD_VALID_SFRAME); }

#define SLI_CPC_DEBUG_TRACE_CORE_RXD_DATA_FRAME_DROPPED()               { SLI_CPC_DEBUG_CORE_COUNTER_INC(rxd_data_frame_dropped); \
                                                                          SLI_CPC_SYSVIEW_MARK_EVENT_ON_CORE(RXD_DATA_FRAME_DROPPED); }

#define SLI_CPC_DEBUG_TRACE_CORE_TXD_REJECT_DESTINATION_UNREACHABLE()   { SLI_CPC_DEBUG_CORE_COUNTER_INC(txd_reject_destination_unreachable); \
                                                                          SLI_CPC_SYSVIEW_MARK_EVENT_ON_CORE(TXD_REJECT_DESTINATION_UNREACHABLE); }

#define SLI_CPC_DEBUG_TRACE_CORE_TXD_REJECT_ERROR_FAULT()               { SLI_CPC_DEBUG_CORE_COUNTER_INC(txd_reject_error_fault); \
                                                                          SLI_CPC_SYSVIEW_MARK_EVENT_ON_CORE(TXD_REJECT_ERROR_FAULT); }

#define SLI_CPC_DEBUG_TRACE_CORE_DRIVER_READ_ERROR()                    { SLI_CPC_DEBUG_CORE_COUNTER_INC(driver_error); \
                                                                          SLI_CPC_SYSVIEW_MARK_EVENT_ON_CORE(DRIVER_READ_ERROR); }

#define SLI_CPC_DEBUG_TRACE_CORE_DRIVER_PACKET_DROPPED()                { SLI_CPC_DEBUG_CORE_COUNTER_INC(driver_packet_dropped); \
                                                                          SLI_CPC_SYSVIEW_MARK_EVENT_ON_CORE(DRIVER_PACKET_DROPPED); }

#define SLI_CPC_DEBUG_TRACE_CORE_INVALID_HEADER_CHECKSUM()              { SLI_CPC_DEBUG_CORE_COUNTER_INC(invalid_header_checksum); \
                                                                          SLI_CPC_SYSVIEW_MARK_EVENT_ON_CORE(INVALID_HEADER_CHECKSUM); }

#define SLI_CPC_DEBUG_TRACE_CORE_INVALID_PAYLOAD_CHECKSUM()              { SLI_CPC_DEBUG_CORE_COUNTER_INC(invalid_payload_checksum); \
                                                                           SLI_CPC_SYSVIEW_MARK_EVENT_ON_CORE(INVALID_PAYLOAD_CHECKSUM); }

#define SLI_CPC_DEBUG_TRACE_CORE_TXD_TRANSMIT_COMPLETED()               { SLI_CPC_DEBUG_CORE_COUNTER_INC(txd_completed); \
                                                                          SLI_CPC_SYSVIEW_MARK_EVENT_ON_CORE(TXD_TRANSMIT_COMPLETED); }

#define SLI_CPC_DEBUG_TRACE_CORE_RE_TRANSMIT_FRAME()                    { SLI_CPC_DEBUG_CORE_COUNTER_INC(retxd_data_frame); \
                                                                          SLI_CPC_SYSVIEW_MARK_EVENT_ON_CORE(RETRANSMIT); }

#define SLI_CPC_DEBUG_TRACE_ENDPOINT_RXD_FRAME(endpoint)                { SLI_CPC_DEBUG_ENDPOINT_COUNTER_INC(endpoint, rxd_packet); \
                                                                          SLI_CPC_SYSVIEW_MARK_EVENT_ON_ENDPOINT(RXD_FRAME, endpoint->id); }

#define SLI_CPC_DEBUG_TRACE_ENDPOINT_RXD_DATA_FRAME(endpoint)           { SLI_CPC_DEBUG_ENDPOINT_COUNTER_INC(endpoint, rxd_data_frame); \
                                                                          SLI_CPC_SYSVIEW_MARK_EVENT_ON_ENDPOINT(RXD_DATA_FRAME, endpoint->id); }

#define SLI_CPC_DEBUG_TRACE_ENDPOINT_RXD_DATA_FRAME_QUEUED(endpoint) { SLI_CPC_DEBUG_ENDPOINT_COUNTER_INC(endpoint, rxd_data_frame_queued); \
                                                                       SLI_CPC_SYSVIEW_MARK_EVENT_ON_ENDPOINT(RXD_DATA_FRAME_QUEUED, endpoint->id); }

#define SLI_CPC_DEBUG_TRACE_ENDPOINT_RXD_DATA_FRAME_DROPPED(endpoint) { SLI_CPC_DEBUG_ENDPOINT_COUNTER_INC(endpoint, rxd_data_frame_dropped); \
                                                                        SLI_CPC_SYSVIEW_MARK_EVENT_ON_ENDPOINT(RXD_DATA_FRAME_DROPPED, endpoint->id); }

#define SLI_CPC_DEBUG_TRACE_ENDPOINT_RXD_SUPERVISORY_FRAME(endpoint) { SLI_CPC_DEBUG_ENDPOINT_COUNTER_INC(endpoint, rxd_supervisory_frame); \
                                                                       SLI_CPC_SYSVIEW_MARK_EVENT_ON_ENDPOINT(RXD_SUPERVISORY_FRAME, endpoint->id); }

#define SLI_CPC_DEBUG_TRACE_ENDPOINT_RXD_SUPERVISORY_PROCESSED(endpoint) { SLI_CPC_DEBUG_ENDPOINT_COUNTER_INC(endpoint, rxd_supervisory_frame_processed); \
                                                                           SLI_CPC_SYSVIEW_MARK_EVENT_ON_ENDPOINT(RXD_SUPERVISORY_PROCESSED, endpoint->id); }

#define SLI_CPC_DEBUG_TRACE_ENDPOINT_RXD_SUPERVISORY_DROPPED(endpoint) { SLI_CPC_DEBUG_ENDPOINT_COUNTER_INC(endpoint, rxd_supervisory_frame_dropped); \
                                                                         SLI_CPC_SYSVIEW_MARK_EVENT_ON_ENDPOINT(RXD_SUPERVISORY_DROPPED, endpoint->id); }

#define SLI_CPC_DEBUG_TRACE_ENDPOINT_RXD_UNNUMBERED_FRAME(endpoint) { SLI_CPC_DEBUG_ENDPOINT_COUNTER_INC(endpoint, rxd_unnumbered_frame); \
                                                                      SLI_CPC_SYSVIEW_MARK_EVENT_ON_ENDPOINT(RXD_SUPERVISORY_FRAME, endpoint->id); }

#define SLI_CPC_DEBUG_TRACE_ENDPOINT_RXD_UNNUMBERED_PROCESSED(endpoint) { SLI_CPC_DEBUG_ENDPOINT_COUNTER_INC(endpoint, rxd_unnumbered_frame_processed); \
                                                                          SLI_CPC_SYSVIEW_MARK_EVENT_ON_ENDPOINT(RXD_SUPERVISORY_PROCESSED, endpoint->id); }

#define SLI_CPC_DEBUG_TRACE_ENDPOINT_RXD_UNNUMBERED_DROPPED(endpoint) { SLI_CPC_DEBUG_ENDPOINT_COUNTER_INC(endpoint, rxd_unnumbered_frame_dropped); \
                                                                        SLI_CPC_SYSVIEW_MARK_EVENT_ON_ENDPOINT(RXD_SUPERVISORY_DROPPED, endpoint->id); }

#define SLI_CPC_DEBUG_TRACE_ENDPOINT_RXD_DUPLICATE_DATA_FRAME(endpoint)  { SLI_CPC_DEBUG_ENDPOINT_COUNTER_INC(endpoint, rxd_duplicate_data_frame); \
                                                                           SLI_CPC_SYSVIEW_MARK_EVENT_ON_ENDPOINT(RXD_DUPLICATE_DATA_FRAME, endpoint->id); }

#define SLI_CPC_DEBUG_TRACE_ENDPOINT_RXD_ACK(endpoint)  { SLI_CPC_DEBUG_ENDPOINT_COUNTER_INC(endpoint, rxd_ack); \
                                                          SLI_CPC_SYSVIEW_MARK_EVENT_ON_ENDPOINT(RXD_ACK, endpoint->id); }

#define SLI_CPC_DEBUG_TRACE_ENDPOINT_RXD_REJECT_DESTINATION_UNREACHABLE(endpoint)  { SLI_CPC_DEBUG_ENDPOINT_COUNTER_INC(endpoint, rxd_reject_destination_unreachable); \
                                                                                     SLI_CPC_SYSVIEW_MARK_EVENT_ON_ENDPOINT(RXD_REJECT_DESTINATION_UNREACHABLE, endpoint->id); }

#define SLI_CPC_DEBUG_TRACE_ENDPOINT_RXD_REJECT_SEQ_MISMATCH(endpoint)  { SLI_CPC_DEBUG_ENDPOINT_COUNTER_INC(endpoint, rxd_reject_seq_mismatch); \
                                                                          SLI_CPC_SYSVIEW_MARK_EVENT_ON_ENDPOINT(RXD_REJECT_SEQ_MISMATCH, endpoint->id); }

#define SLI_CPC_DEBUG_TRACE_ENDPOINT_RXD_REJECT_CHECSUM_MISMATCH(endpoint)  { SLI_CPC_DEBUG_ENDPOINT_COUNTER_INC(endpoint, rxd_reject_checksum_mismatch); \
                                                                              SLI_CPC_SYSVIEW_MARK_EVENT_ON_ENDPOINT(RXD_REJECT_CHECSUM_MISMATCH, endpoint->id); }

#define SLI_CPC_DEBUG_TRACE_ENDPOINT_RXD_REJECT_SECURITY_ISSUE(endpoint)  { SLI_CPC_DEBUG_ENDPOINT_COUNTER_INC(endpoint, rxd_reject_security_issue); \
                                                                            SLI_CPC_SYSVIEW_MARK_EVENT_ON_ENDPOINT(RXD_REJECT_SECURITY_ISSUE, endpoint->id); }

#define SLI_CPC_DEBUG_TRACE_ENDPOINT_RXD_REJECT_OUT_OF_MEMORY(endpoint)  { SLI_CPC_DEBUG_ENDPOINT_COUNTER_INC(endpoint, rxd_reject_out_of_memory); \
                                                                           SLI_CPC_SYSVIEW_MARK_EVENT_ON_ENDPOINT(RXD_REJECT_OUT_OF_MEMORY, endpoint->id); }

#define SLI_CPC_DEBUG_TRACE_ENDPOINT_RXD_REJECT_FAULT(endpoint)  { SLI_CPC_DEBUG_ENDPOINT_COUNTER_INC(endpoint, rxd_reject_fault); \
                                                                   SLI_CPC_SYSVIEW_MARK_EVENT_ON_ENDPOINT(RXD_REJECT_FAULT, endpoint->id); }

