espressif/esp-matter/connectedhomeip/connectedhomeip/third_party/openthread/ot-efr32/third_party/silabs/gecko_sdk/platform/service/cpc/inc/sli_cpc_debug.h
#define SLI_CPC_DEBUG_TRACE_ENDPOINT_TXD_DATA_FRAME(endpoint)  { SLI_CPC_DEBUG_ENDPOINT_COUNTER_INC(endpoint, txd_data_frame); \
                                                                 SLI_CPC_SYSVIEW_MARK_EVENT_ON_ENDPOINT(TXD_DATA_FRAME, endpoint->id); }

#define SLI_CPC_DEBUG_TRACE_ENDPOINT_TXD_ACK(endpoint)  { SLI_CPC_DEBUG_ENDPOINT_COUNTER_INC(endpoint, txd_ack); \
                                                          SLI_CPC_SYSVIEW_MARK_EVENT_ON_ENDPOINT(TXD_ACK, endpoint->id); }

#define SLI_CPC_DEBUG_TRACE_ENDPOINT_TXD_REJECT_DESTINATION_UNREACHABLE(endpoint)  { SLI_CPC_DEBUG_ENDPOINT_COUNTER_INC(endpoint, txd_reject_destination_unreachable); \
                                                                                     SLI_CPC_SYSVIEW_MARK_EVENT_ON_ENDPOINT(TXD_REJECT_DESTINATION_UNREACHABLE, endpoint->id); }

#define SLI_CPC_DEBUG_TRACE_ENDPOINT_TXD_REJECT_SEQ_MISMATCH(endpoint)  { SLI_CPC_DEBUG_ENDPOINT_COUNTER_INC(endpoint, txd_reject_seq_mismatch); \
                                                                          SLI_CPC_SYSVIEW_MARK_EVENT_ON_ENDPOINT(TXD_REJECT_SEQ_MISMATCH, endpoint->id); }

#define SLI_CPC_DEBUG_TRACE_ENDPOINT_TXD_REJECT_CHECKSUM_MISMATCH(endpoint)  { SLI_CPC_DEBUG_ENDPOINT_COUNTER_INC(endpoint, txd_reject_checksum_mismatch); \
                                                                               SLI_CPC_SYSVIEW_MARK_EVENT_ON_ENDPOINT(TXD_REJECT_CHECSUM_MISMATCH, endpoint->id); }

#define SLI_CPC_DEBUG_TRACE_ENDPOINT_TXD_REJECT_SECURITY_ISSUE(endpoint)  { SLI_CPC_DEBUG_ENDPOINT_COUNTER_INC(endpoint, txd_reject_security_issue); \
                                                                            SLI_CPC_SYSVIEW_MARK_EVENT_ON_ENDPOINT(TXD_REJECT_SECURITY_ISSUE, endpoint->id); }

#define SLI_CPC_DEBUG_TRACE_ENDPOINT_TXD_REJECT_OUT_OF_MEMORY(endpoint)  { SLI_CPC_DEBUG_ENDPOINT_COUNTER_INC(endpoint, txd_reject_out_of_memory); \
                                                                           SLI_CPC_SYSVIEW_MARK_EVENT_ON_ENDPOINT(TXD_REJECT_OUT_OF_MEMORY, endpoint->id); }

#define SLI_CPC_DEBUG_TRACE_ENDPOINT_TXD_REJECT_FAULT(endpoint)  { SLI_CPC_DEBUG_ENDPOINT_COUNTER_INC(endpoint, txd_reject_fault); \
                                                                   SLI_CPC_SYSVIEW_MARK_EVENT_ON_ENDPOINT(TXD_REJECT_FAULT, endpoint->id); }

#define SLI_CPC_DEBUG_TRACE_ENDPOINT_RETXD_DATA_FRAME(endpoint)  { SLI_CPC_DEBUG_ENDPOINT_COUNTER_INC(endpoint, retxd_data_frame); \
                                                                   SLI_CPC_SYSVIEW_MARK_EVENT_ON_ENDPOINT(RETXD_DATA_FRAME, endpoint->id); }

#define SLI_CPC_DEBUG_TRACE_ENDPOINT_FRAME_TRANSMIT_SUBMITTED(endpoint)  { SLI_CPC_DEBUG_ENDPOINT_COUNTER_INC(endpoint, frame_transmit_submitted); \
                                                                           SLI_CPC_SYSVIEW_MARK_EVENT_ON_ENDPOINT(FRAME_TRANSMIT_SUBMITTED, endpoint->id); }

#define SLI_CPC_DEBUG_TRACE_ENDPOINT_FRAME_TRANSMIT_COMPLETED(endpoint)  { SLI_CPC_DEBUG_ENDPOINT_COUNTER_INC(endpoint, frame_transmit_completed); \
                                                                           SLI_CPC_SYSVIEW_MARK_EVENT_ON_ENDPOINT(FRAME_TRANSMIT_COMPLETED, endpoint->id); }

#define SLI_CPC_DEBUG_TRACE_ENDPOINT_DATA_FRAME_TRANSMIT_COMPLETED(endpoint)  { SLI_CPC_DEBUG_ENDPOINT_COUNTER_INC(endpoint, data_frame_transmit_completed); \
                                                                                SLI_CPC_SYSVIEW_MARK_EVENT_ON_ENDPOINT(FRAME_TRANSMIT_COMPLETED, endpoint->id); }

#define SLI_CPC_DEBUG_TRACE_ENDPOINT_SUPERVISORY_FRAME_TRANSMIT_COMPLETED(endpoint)  { SLI_CPC_DEBUG_ENDPOINT_COUNTER_INC(endpoint, supervisory_frame_transmit_completed); \
                                                                                       SLI_CPC_SYSVIEW_MARK_EVENT_ON_ENDPOINT(FRAME_TRANSMIT_COMPLETED, endpoint->id); }

// DEBUG EVENTS COUNTERS ON CORE
#if (SL_CPC_DEBUG_CORE_EVENT_COUNTERS == 1)
#define SLI_CPC_DEBUG_CORE_INIT()                 (memset(&sl_cpc_core_debug.core_counters, 0, sizeof(sl_cpc_core_debug.core_counters)))
#define SLI_CPC_DEBUG_CORE_COUNTER_INC(counter)   ((sl_cpc_core_debug.core_counters.counter)++)
#else // SL_CPC_DEBUG_CORE_EVENT_COUNTERS
#define SLI_CPC_DEBUG_CORE_INIT()
#define SLI_CPC_DEBUG_CORE_COUNTER_INC(counter)
#endif  // SL_CPC_DEBUG_CORE_EVENT_COUNTERS

// DEBUG EVENTS COUNTERS ON ENDPOINT
#if (SL_CPC_DEBUG_ENDPOINT_EVENT_COUNTERS == 1)
#define SLI_CPC_DEBUG_ENDPOINT_INIT(endpoint)                   (memset(&endpoint->debug_counters, 0, sizeof(endpoint->debug_counters)))
#define SLI_CPC_DEBUG_ENDPOINT_COUNTER_INC(endpoint, counter)   ((endpoint->debug_counters.counter)++)
#else // SL_CPC_DEBUG_ENDPOINT_EVENT_COUNTERS
#define SLI_CPC_DEBUG_ENDPOINT_INIT(endpoint)
#define SLI_CPC_DEBUG_ENDPOINT_COUNTER_INC(endpoint, counter)
#endif  // SL_CPC_DEBUG_ENDPOINT_EVENT_COUNTERS

#if (SL_CPC_DEBUG_MEMORY_ALLOCATOR_COUNTERS == 1)
#define SLI_CPC_DEBUG_MEMORY_POOL_INIT()          sl_cpc_core_debug.memory_pool.buffer_handle = &cpc_mempool_buffer_handle; \
  sl_cpc_core_debug.memory_pool.hdlc_header = &cpc_mempool_hdlc_header;                                                     \
  sl_cpc_core_debug.memory_pool.hdlc_reject = &cpc_mempool_hdlc_reject;                                                     \
  sl_cpc_core_debug.memory_pool.rx_buffer = &cpc_mempool_rx_buffer;                                                         \
  sl_cpc_core_debug.memory_pool.endpoint = &cpc_mempool_endpoint;                                                           \
  sl_cpc_core_debug.memory_pool.rx_queue_item = &cpc_mempool_rx_queue_item;                                                 \
  sl_cpc_core_debug.memory_pool.tx_queue_item = &cpc_mempool_tx_queue_item;                                                 \
  sl_cpc_core_debug.memory_pool.system_command = &cpc_mempool_system_command;                                               \
  sl_cpc_core_debug.memory_pool.endpoint_closed_arg_item = &cpc_mempool_endpoint_closed_arg_item;
#else
#define SLI_CPC_DEBUG_MEMORY_POOL_INIT()
#endif

