espressif/esp-matter/connectedhomeip/connectedhomeip/third_party/openthread/ot-efr32/third_party/silabs/gecko_sdk/platform/service/cpc/inc/sli_cpc_debug.h
// CORE EVENT ID
#if !defined(SLI_CPC_SYSVIEW_CORE_EVENT_ID)
#define SLI_CPC_SYSVIEW_CORE_EVENT_ID 9999
#endif

// ENDPOINT ID and MULTIPLICATOR
#if !defined(CPC_CORE_EVENT_ID_MULTIPLIER)
#define CPC_ENDPOINT_EVENT_ID_OFFSET 10000
#endif
#if !defined(CPC_CORE_EVENT_ID_MULTIPLIER)
#define CPC_ENDPOINT_EVENT_ID_MULTIPLIER 1000
#endif

// SYSTEMVIEW TRACE MACRO
#define SLI_CPC_SYSVIEW_MARK_EVENT_ON_CORE(event)
#define SLI_CPC_SYSVIEW_MARK_EVENT_ON_ENDPOINT(event, endpoint)
#if (SL_CPC_DEBUG_SYSTEM_VIEW_LOG_CORE_EVENT == 1)
#undef SLI_CPC_SYSVIEW_MARK_EVENT_ON_CORE
#define SLI_CPC_SYSVIEW_MARK_EVENT_ON_CORE(event) SEGGER_SYSVIEW_NameMarker(SLI_CPC_SYSVIEW_CORE_EVENT_ID, SLI_CPC_SYSVIEW_ON_CORE_ ## event ## _MESSAGE)
#endif

#if (SL_CPC_DEBUG_SYSTEM_VIEW_LOG_ENDPOINT_EVENT == 1)
#undef SLI_CPC_SYSVIEW_MARK_EVENT_ON_ENDPOINT
#define SLI_CPC_SYSVIEW_MARK_EVENT_ON_ENDPOINT(event, endpoint) SEGGER_SYSVIEW_NameMarker(SLI_CPC_SYSVIEW_ON_ENDPOINT_ ## event ## _EVENT_ID + endpoint, SLI_CPC_SYSVIEW_ON_ENDPOINT_ ## event ## _EVENT_MESSAGE)
#endif

#define STR_EXPAND(tok) #tok
#define STR(tok) STR_EXPAND(tok)

#define ON_ENDPOINT_STR_MESSAGE(EVENT, NRB, MULTIPLER)   "CPC: " EVENT " [EP ID = MarkerID - (" STR(NRB) " * " STR(MULTIPLER) ")]"

// SYSTEMVIEW; CORE MESSAGE
#define SLI_CPC_SYSVIEW_ON_CORE_OPEN_ENDPOINT_MESSAGE "CPC: Open endpoint"
#define SLI_CPC_SYSVIEW_ON_CORE_CLOSE_ENDPOINT_MESSAGE "CPC: Close endpoint"
#define SLI_CPC_SYSVIEW_ON_CORE_RX_FRAME_MESSAGE "CPC: Receive Frame"
#define SLI_CPC_SYSVIEW_ON_CORE_RXD_VALID_FRAME_MESSAGE "CPC: Received valid frame"
#define SLI_CPC_SYSVIEW_ON_CORE_RXD_DATA_FRAME_DROPPED_MESSAGE "CPC: Frame dropped"
#define SLI_CPC_SYSVIEW_ON_CORE_TXD_REJECT_DESTINATION_UNREACHABLE_MESSAGE "CPC: Transmit Destination unreachable"
#define SLI_CPC_SYSVIEW_ON_CORE_TXD_REJECT_ERROR_FAULT_MESSAGE "CPC: Transmit Error fault"
#define SLI_CPC_SYSVIEW_ON_CORE_TXD_TRANSMIT_COMPLETED_MESSAGE "CPC: Transmit completed"
#define SLI_CPC_SYSVIEW_ON_CORE_INVALID_HEADER_CHECKSUM_MESSAGE "CPC: Invalid checksum in protocol header"
#define SLI_CPC_SYSVIEW_ON_CORE_DRIVER_READ_ERROR_MESSAGE "CPC: Driver reported an error"
#define SLI_CPC_SYSVIEW_ON_CORE_DRIVER_PACKET_DROPPED_MESSAGE "CPC: Driver dropped a packet"
#define SLI_CPC_SYSVIEW_ON_CORE_RXD_VALID_IFRAME_MESSAGE "CPC: Valid iframe received"
#define SLI_CPC_SYSVIEW_ON_CORE_RXD_VALID_SFRAME_MESSAGE "CPC: Valid sframe received"
#define SLI_CPC_SYSVIEW_ON_CORE_RXD_VALID_UFRAME_MESSAGE "CPC: Valid uframe received"
#define SLI_CPC_SYSVIEW_ON_CORE_INVALID_PAYLOAD_CHECKSUM_MESSAGE "CPC: Invalid checksum on payload"
#define SLI_CPC_SYSVIEW_ON_CORE_RETRANSMIT_MESSAGE "CPC: Frame re-transmitted"

// SYSTEMVIEW; ENDPOINT EVENT IDs and MESSAGES
#define SLI_CPC_SYSVIEW_ON_ENDPOINT_RXD_FRAME_EVENT_NBR                         1
#define SLI_CPC_SYSVIEW_ON_ENDPOINT_RXD_FRAME_EVENT_MARKER                      (SLI_CPC_SYSVIEW_ON_ENDPOINT_RXD_FRAME_EVENT_NBR * CPC_ENDPOINT_EVENT_ID_MULTIPLIER)
#define SLI_CPC_SYSVIEW_ON_ENDPOINT_RXD_FRAME_EVENT_ID                          (SLI_CPC_SYSVIEW_ON_ENDPOINT_RXD_FRAME_EVENT_MARKER + CPC_ENDPOINT_EVENT_ID_OFFSET)
#define SLI_CPC_SYSVIEW_ON_ENDPOINT_RXD_FRAME_EVENT_MESSAGE                     ON_ENDPOINT_STR_MESSAGE("Received frame", SLI_CPC_SYSVIEW_ON_ENDPOINT_RXD_FRAME_EVENT_NBR, CPC_ENDPOINT_EVENT_ID_MULTIPLIER)

#define SLI_CPC_SYSVIEW_ON_ENDPOINT_DATA_RX_EVENT_NBR                           2
#define SLI_CPC_SYSVIEW_ON_ENDPOINT_DATA_RX_EVENT_MARKER                        (SLI_CPC_SYSVIEW_ON_ENDPOINT_DATA_RX_EVENT_NBR * CPC_ENDPOINT_EVENT_ID_MULTIPLIER)
#define SLI_CPC_SYSVIEW_ON_ENDPOINT_DATA_RX_EVENT_ID                            (SLI_CPC_SYSVIEW_ON_ENDPOINT_DATA_RX_EVENT_MARKER + CPC_ENDPOINT_EVENT_ID_OFFSET)
#define SLI_CPC_SYSVIEW_ON_ENDPOINT_DATA_RX_EVENT_MESSAGE                       ON_ENDPOINT_STR_MESSAGE("Received Data", SLI_CPC_SYSVIEW_ON_ENDPOINT_DATA_RX_EVENT_NBR, CPC_ENDPOINT_EVENT_ID_MULTIPLIER)

#define SLI_CPC_SYSVIEW_ON_ENDPOINT_DATA_TX_EVENT_NBR                           3
#define SLI_CPC_SYSVIEW_ON_ENDPOINT_DATA_TX_EVENT_MARKER                        (SLI_CPC_SYSVIEW_ON_ENDPOINT_DATA_TX_EVENT_NBR * CPC_ENDPOINT_EVENT_ID_MULTIPLIER)
#define SLI_CPC_SYSVIEW_ON_ENDPOINT_DATA_TX_EVENT_ID                            (SLI_CPC_SYSVIEW_ON_ENDPOINT_DATA_TX_EVENT_MARKER + CPC_ENDPOINT_EVENT_ID_OFFSET)
#define SLI_CPC_SYSVIEW_ON_ENDPOINT_DATA_TX_EVENT_MESSAGE                       ON_ENDPOINT_STR_MESSAGE("Packet sent", SLI_CPC_SYSVIEW_ON_ENDPOINT_DATA_TX_EVENT_NBR, CPC_ENDPOINT_EVENT_ID_MULTIPLIER)

#define SLI_CPC_SYSVIEW_ON_ENDPOINT_ACK_TX_EVENT_NBR                            4
#define SLI_CPC_SYSVIEW_ON_ENDPOINT_ACK_TX_EVENT_MARKER                         (SLI_CPC_SYSVIEW_ON_ENDPOINT_ACK_TX_EVENT_NBR * CPC_ENDPOINT_EVENT_ID_MULTIPLIER)
#define SLI_CPC_SYSVIEW_ON_ENDPOINT_ACK_TX_EVENT_ID                             (SLI_CPC_SYSVIEW_ON_ENDPOINT_ACK_TX_EVENT_MARKER + CPC_ENDPOINT_EVENT_ID_OFFSET)
#define SLI_CPC_SYSVIEW_ON_ENDPOINT_ACK_TX_EVENT_MESSAGE                        ON_ENDPOINT_STR_MESSAGE("ACK sent", SLI_CPC_SYSVIEW_ON_ENDPOINT_ACK_TX_EVENT_NBR, CPC_ENDPOINT_EVENT_ID_MULTIPLIER)

#define SLI_CPC_SYSVIEW_ON_ENDPOINT_ACK_RX_EVENT_NBR                            5
#define SLI_CPC_SYSVIEW_ON_ENDPOINT_ACK_RX_EVENT_MARKER                         (SLI_CPC_SYSVIEW_ON_ENDPOINT_ACK_RX_EVENT_NBR * CPC_ENDPOINT_EVENT_ID_MULTIPLIER)
#define SLI_CPC_SYSVIEW_ON_ENDPOINT_ACK_RX_EVENT_ID                             (SLI_CPC_SYSVIEW_ON_ENDPOINT_ACK_RX_EVENT_MARKER + CPC_ENDPOINT_EVENT_ID_OFFSET)
#define SLI_CPC_SYSVIEW_ON_ENDPOINT_ACK_RX_EVENT_MESSAGE                        ON_ENDPOINT_STR_MESSAGE("Received ACK", SLI_CPC_SYSVIEW_ON_ENDPOINT_ACK_RX_EVENT_NBR, CPC_ENDPOINT_EVENT_ID_MULTIPLIER)

#define SLI_CPC_SYSVIEW_ON_ENDPOINT_RETRANSMIT_EVENT_NBR                        6
#define SLI_CPC_SYSVIEW_ON_ENDPOINT_RETRANSMIT_EVENT_MARKER                     (SLI_CPC_SYSVIEW_ON_ENDPOINT_RETRANSMIT_EVENT_NBR * CPC_ENDPOINT_EVENT_ID_MULTIPLIER)
#define SLI_CPC_SYSVIEW_ON_ENDPOINT_RETRANSMIT_EVENT_ID                         (SLI_CPC_SYSVIEW_ON_ENDPOINT_RETRANSMIT_EVENT_MARKER + CPC_ENDPOINT_EVENT_ID_OFFSET)
#define SLI_CPC_SYSVIEW_ON_ENDPOINT_RETRANSMIT_EVENT_MESSAGE                    ON_ENDPOINT_STR_MESSAGE("Retransmitted frame", SLI_CPC_SYSVIEW_ON_ENDPOINT_RETRANSMIT_EVENT_NBR, CPC_ENDPOINT_EVENT_ID_MULTIPLIER)

#define SLI_CPC_SYSVIEW_ON_ENDPOINT_PACKET_DROPPED_EVENT_NBR                    7
#define SLI_CPC_SYSVIEW_ON_ENDPOINT_PACKET_DROPPED_EVENT_MARKER                 (SLI_CPC_SYSVIEW_ON_ENDPOINT_PACKET_DROPPED_EVENT_NBR * CPC_ENDPOINT_EVENT_ID_MULTIPLIER)
#define SLI_CPC_SYSVIEW_ON_ENDPOINT_PACKET_DROPPED_EVENT_ID                     (SLI_CPC_SYSVIEW_ON_ENDPOINT_PACKET_DROPPED_EVENT_MARKER + CPC_ENDPOINT_EVENT_ID_OFFSET)
#define SLI_CPC_SYSVIEW_ON_ENDPOINT_PACKET_DROPPED_EVENT_MESSAGE                ON_ENDPOINT_STR_MESSAGE("Dropped packet", SLI_CPC_SYSVIEW_ON_ENDPOINT_PACKET_DROPPED_EVENT_NBR, CPC_ENDPOINT_EVENT_ID_MULTIPLIER)

#define SLI_CPC_SYSVIEW_ON_ENDPOINT_CRC_ERROR_EVENT_NBR                         8
#define SLI_CPC_SYSVIEW_ON_ENDPOINT_CRC_ERROR_EVENT_MARKER                      (SLI_CPC_SYSVIEW_ON_ENDPOINT_CRC_ERROR_EVENT_NBR * CPC_ENDPOINT_EVENT_ID_MULTIPLIER)
#define SLI_CPC_SYSVIEW_ON_ENDPOINT_CRC_ERROR_EVENT_ID                          (SLI_CPC_SYSVIEW_ON_ENDPOINT_CRC_ERROR_EVENT_MARKER + CPC_ENDPOINT_EVENT_ID_OFFSET)
#define SLI_CPC_SYSVIEW_ON_ENDPOINT_CRC_ERROR_EVENT_MESSAGE                     ON_ENDPOINT_STR_MESSAGE("CRC Error", SLI_CPC_SYSVIEW_ON_ENDPOINT_CRC_ERROR_EVENT_NBR, CPC_ENDPOINT_EVENT_ID_MULTIPLIER)

#define SLI_CPC_SYSVIEW_ON_ENDPOINT_INVALID_FCS_EVENT_NBR                       9
#define SLI_CPC_SYSVIEW_ON_ENDPOINT_INVALID_FCS_EVENT_MARKER                    (SLI_CPC_SYSVIEW_ON_ENDPOINT_INVALID_FCS_EVENT_NBR * CPC_ENDPOINT_EVENT_ID_MULTIPLIER)
#define SLI_CPC_SYSVIEW_ON_ENDPOINT_INVALID_FCS_EVENT_ID                        (SLI_CPC_SYSVIEW_ON_ENDPOINT_INVALID_FCS_EVENT_MARKER + CPC_ENDPOINT_EVENT_ID_OFFSET)
#define SLI_CPC_SYSVIEW_ON_ENDPOINT_INVALID_FCS_EVENT_MESSAGE                   ON_ENDPOINT_STR_MESSAGE("Invalid FCS", SLI_CPC_SYSVIEW_ON_ENDPOINT_INVALID_FCS_EVENT_NBR, CPC_ENDPOINT_EVENT_ID_MULTIPLIER)

#define SLI_CPC_SYSVIEW_ON_ENDPOINT_INVALID_SEQ_EVENT_NBR                       10
#define SLI_CPC_SYSVIEW_ON_ENDPOINT_INVALID_SEQ_EVENT_MARKER                    (SLI_CPC_SYSVIEW_ON_ENDPOINT_INVALID_SEQ_EVENT_NBR * CPC_ENDPOINT_EVENT_ID_MULTIPLIER)
#define SLI_CPC_SYSVIEW_ON_ENDPOINT_INVALID_SEQ_EVENT_ID                        (SLI_CPC_SYSVIEW_ON_ENDPOINT_INVALID_SEQ_EVENT_MARKER + CPC_ENDPOINT_EVENT_ID_OFFSET)
#define SLI_CPC_SYSVIEW_ON_ENDPOINT_INVALID_SEQ_EVENT_MESSAGE                   ON_ENDPOINT_STR_MESSAGE("Invalid sequence number", SLI_CPC_SYSVIEW_ON_ENDPOINT_INVALID_SEQ_EVENT_NBR, CPC_ENDPOINT_EVENT_ID_MULTIPLIER)

#define SLI_CPC_SYSVIEW_ON_ENDPOINT_INVALID_OUT_OF_MEMORY_EVENT_NBR             11
#define SLI_CPC_SYSVIEW_ON_ENDPOINT_INVALID_OUT_OF_MEMORY_EVENT_MARKER          (SLI_CPC_SYSVIEW_ON_ENDPOINT_INVALID_OUT_OF_MEMORY_EVENT_NBR * CPC_ENDPOINT_EVENT_ID_MULTIPLIER)
#define SLI_CPC_SYSVIEW_ON_ENDPOINT_INVALID_OUT_OF_MEMORY_EVENT_ID              (SLI_CPC_SYSVIEW_ON_ENDPOINT_INVALID_OUT_OF_MEMORY_EVENT_MARKER + CPC_ENDPOINT_EVENT_ID_OFFSET)
#define SLI_CPC_SYSVIEW_ON_ENDPOINT_INVALID_OUT_OF_MEMORY_EVENT_MESSAGE         ON_ENDPOINT_STR_MESSAGE("Ran out of memory", SLI_CPC_SYSVIEW_ON_ENDPOINT_INVALID_OUT_OF_MEMORY_EVENT_NBR, CPC_ENDPOINT_EVENT_ID_MULTIPLIER)

#define SLI_CPC_SYSVIEW_ON_ENDPOINT_TXD_REJECT_DESTINATION_UNREACHABLE_EVENT_NBR      12
#define SLI_CPC_SYSVIEW_ON_ENDPOINT_TXD_REJECT_DESTINATION_UNREACHABLE_EVENT_MARKER   (SLI_CPC_SYSVIEW_ON_ENDPOINT_TXD_REJECT_DESTINATION_UNREACHABLE_EVENT_NBR * CPC_ENDPOINT_EVENT_ID_MULTIPLIER)
#define SLI_CPC_SYSVIEW_ON_ENDPOINT_TXD_REJECT_DESTINATION_UNREACHABLE_EVENT_ID       (SLI_CPC_SYSVIEW_ON_ENDPOINT_TXD_REJECT_DESTINATION_UNREACHABLE_EVENT_MARKER + CPC_ENDPOINT_EVENT_ID_OFFSET)
#define SLI_CPC_SYSVIEW_ON_ENDPOINT_TXD_REJECT_DESTINATION_UNREACHABLE_EVENT_MESSAGE  ON_ENDPOINT_STR_MESSAGE("Transmit destination unreachable", SLI_CPC_SYSVIEW_ON_ENDPOINT_TXD_REJECT_DESTINATION_UNREACHABLE_EVENT_NBR, CPC_ENDPOINT_EVENT_ID_MULTIPLIER)

#define SLI_CPC_SYSVIEW_ON_ENDPOINT_FRAME_TRANSMIT_COMPLETED_NBR                13
#define SLI_CPC_SYSVIEW_ON_ENDPOINT_FRAME_TRANSMIT_COMPLETED_EVENT_MARKER       (SLI_CPC_SYSVIEW_ON_ENDPOINT_FRAME_TRANSMIT_COMPLETED_NBR * CPC_ENDPOINT_EVENT_ID_MULTIPLIER)
#define SLI_CPC_SYSVIEW_ON_ENDPOINT_FRAME_TRANSMIT_COMPLETED_EVENT_ID           (SLI_CPC_SYSVIEW_ON_ENDPOINT_FRAME_TRANSMIT_COMPLETED_EVENT_MARKER + CPC_ENDPOINT_EVENT_ID_OFFSET)
#define SLI_CPC_SYSVIEW_ON_ENDPOINT_FRAME_TRANSMIT_COMPLETED_EVENT_MESSAGE      ON_ENDPOINT_STR_MESSAGE("Transmit completed", SLI_CPC_SYSVIEW_ON_ENDPOINT_FRAME_TRANSMIT_COMPLETED_NBR, CPC_ENDPOINT_EVENT_ID_MULTIPLIER)

#define SLI_CPC_SYSVIEW_ON_ENDPOINT_RXD_DATA_FRAME_EVENT_NBR                    14
#define SLI_CPC_SYSVIEW_ON_ENDPOINT_RXD_DATA_FRAME_EVENT_MARKER                 (SLI_CPC_SYSVIEW_ON_ENDPOINT_RXD_DATA_FRAME_EVENT_NBR * CPC_ENDPOINT_EVENT_ID_MULTIPLIER)
#define SLI_CPC_SYSVIEW_ON_ENDPOINT_RXD_DATA_FRAME_EVENT_ID                     (SLI_CPC_SYSVIEW_ON_ENDPOINT_RXD_DATA_FRAME_EVENT_MARKER + CPC_ENDPOINT_EVENT_ID_OFFSET)
#define SLI_CPC_SYSVIEW_ON_ENDPOINT_RXD_DATA_FRAME_EVENT_MESSAGE                ON_ENDPOINT_STR_MESSAGE("Received Data frame", SLI_CPC_SYSVIEW_ON_ENDPOINT_RXD_DATA_FRAME_EVENT_NBR, CPC_ENDPOINT_EVENT_ID_MULTIPLIER)

