espressif/esp-matter/connectedhomeip/connectedhomeip/third_party/openthread/ot-efr32/third_party/silabs/gecko_sdk/platform/service/cpc/inc/sli_cpc_debug.h
#define SLI_CPC_SYSVIEW_ON_ENDPOINT_RXD_DUPLICATE_DATA_FRAME_EVENT_NBR          15
#define SLI_CPC_SYSVIEW_ON_ENDPOINT_RXD_DUPLICATE_DATA_FRAME_EVENT_MARKER       (SLI_CPC_SYSVIEW_ON_ENDPOINT_RXD_DUPLICATE_DATA_FRAME_EVENT_NBR * CPC_ENDPOINT_EVENT_ID_MULTIPLIER)
#define SLI_CPC_SYSVIEW_ON_ENDPOINT_RXD_DUPLICATE_DATA_FRAME_EVENT_ID           (SLI_CPC_SYSVIEW_ON_ENDPOINT_RXD_DUPLICATE_DATA_FRAME_EVENT_MARKER + CPC_ENDPOINT_EVENT_ID_OFFSET)
#define SLI_CPC_SYSVIEW_ON_ENDPOINT_RXD_DUPLICATE_DATA_FRAME_EVENT_MESSAGE      ON_ENDPOINT_STR_MESSAGE("Received duplicated data", SLI_CPC_SYSVIEW_ON_ENDPOINT_RXD_DUPLICATE_DATA_FRAME_EVENT_NBR, CPC_ENDPOINT_EVENT_ID_MULTIPLIER)

#define SLI_CPC_SYSVIEW_ON_ENDPOINT_RXD_SUPERVISORY_FRAME_EVENT_NBR             16
#define SLI_CPC_SYSVIEW_ON_ENDPOINT_RXD_SUPERVISORY_FRAME_EVENT_MARKER          (SLI_CPC_SYSVIEW_ON_ENDPOINT_RXD_SUPERVISORY_FRAME_EVENT_NBR * CPC_ENDPOINT_EVENT_ID_MULTIPLIER)
#define SLI_CPC_SYSVIEW_ON_ENDPOINT_RXD_SUPERVISORY_FRAME_EVENT_ID              (SLI_CPC_SYSVIEW_ON_ENDPOINT_RXD_SUPERVISORY_FRAME_EVENT_MARKER + CPC_ENDPOINT_EVENT_ID_OFFSET)
#define SLI_CPC_SYSVIEW_ON_ENDPOINT_RXD_SUPERVISORY_FRAME_EVENT_MESSAGE         ON_ENDPOINT_STR_MESSAGE("Supervisory frame received", SLI_CPC_SYSVIEW_ON_ENDPOINT_RXD_SUPERVISORY_FRAME_EVENT_NBR, CPC_ENDPOINT_EVENT_ID_MULTIPLIER)

#define SLI_CPC_SYSVIEW_ON_ENDPOINT_RXD_SUPERVISORY_PROCESSED_EVENT_NBR         17
#define SLI_CPC_SYSVIEW_ON_ENDPOINT_RXD_SUPERVISORY_PROCESSED_EVENT_MARKER      (SLI_CPC_SYSVIEW_ON_ENDPOINT_RXD_SUPERVISORY_PROCESSED_EVENT_NBR * CPC_ENDPOINT_EVENT_ID_MULTIPLIER)
#define SLI_CPC_SYSVIEW_ON_ENDPOINT_RXD_SUPERVISORY_PROCESSED_EVENT_ID          (SLI_CPC_SYSVIEW_ON_ENDPOINT_RXD_SUPERVISORY_PROCESSED_EVENT_MARKER + CPC_ENDPOINT_EVENT_ID_OFFSET)
#define SLI_CPC_SYSVIEW_ON_ENDPOINT_RXD_SUPERVISORY_PROCESSED_EVENT_MESSAGE     ON_ENDPOINT_STR_MESSAGE("Supervisory frame processed", SLI_CPC_SYSVIEW_ON_ENDPOINT_RXD_SUPERVISORY_PROCESSED_EVENT_NBR, CPC_ENDPOINT_EVENT_ID_MULTIPLIER)

#define SLI_CPC_SYSVIEW_ON_ENDPOINT_RXD_REJECT_SEQ_MISMATCH_EVENT_NBR           18
#define SLI_CPC_SYSVIEW_ON_ENDPOINT_RXD_REJECT_SEQ_MISMATCH_EVENT_MARKER        (SLI_CPC_SYSVIEW_ON_ENDPOINT_RXD_REJECT_SEQ_MISMATCH_EVENT_NBR * CPC_ENDPOINT_EVENT_ID_MULTIPLIER)
#define SLI_CPC_SYSVIEW_ON_ENDPOINT_RXD_REJECT_SEQ_MISMATCH_EVENT_ID            (SLI_CPC_SYSVIEW_ON_ENDPOINT_RXD_REJECT_SEQ_MISMATCH_EVENT_MARKER + CPC_ENDPOINT_EVENT_ID_OFFSET)
#define SLI_CPC_SYSVIEW_ON_ENDPOINT_RXD_REJECT_SEQ_MISMATCH_EVENT_MESSAGE       ON_ENDPOINT_STR_MESSAGE("Received reject with sequence mismatch", SLI_CPC_SYSVIEW_ON_ENDPOINT_RXD_REJECT_SEQ_MISMATCH_EVENT_NBR, CPC_ENDPOINT_EVENT_ID_MULTIPLIER)

#define SLI_CPC_SYSVIEW_ON_ENDPOINT_RXD_REJECT_CHECSUM_MISMATCH_EVENT_NBR       19
#define SLI_CPC_SYSVIEW_ON_ENDPOINT_RXD_REJECT_CHECSUM_MISMATCH_EVENT_MARKER    (SLI_CPC_SYSVIEW_ON_ENDPOINT_RXD_REJECT_CHECSUM_MISMATCH_EVENT_NBR * CPC_ENDPOINT_EVENT_ID_MULTIPLIER)
#define SLI_CPC_SYSVIEW_ON_ENDPOINT_RXD_REJECT_CHECSUM_MISMATCH_EVENT_ID        (SLI_CPC_SYSVIEW_ON_ENDPOINT_RXD_REJECT_CHECSUM_MISMATCH_EVENT_MARKER + CPC_ENDPOINT_EVENT_ID_OFFSET)
#define SLI_CPC_SYSVIEW_ON_ENDPOINT_RXD_REJECT_CHECSUM_MISMATCH_EVENT_MESSAGE   ON_ENDPOINT_STR_MESSAGE("Received reject with checksum mismatch", SLI_CPC_SYSVIEW_ON_ENDPOINT_RXD_REJECT_CHECSUM_MISMATCH_EVENT_NBR, CPC_ENDPOINT_EVENT_ID_MULTIPLIER)

#define SLI_CPC_SYSVIEW_ON_ENDPOINT_RXD_REJECT_OUT_OF_MEMORY_EVENT_NBR          20
#define SLI_CPC_SYSVIEW_ON_ENDPOINT_RXD_REJECT_OUT_OF_MEMORY_EVENT_MARKER       (SLI_CPC_SYSVIEW_ON_ENDPOINT_RXD_REJECT_OUT_OF_MEMORY_EVENT_NBR * CPC_ENDPOINT_EVENT_ID_MULTIPLIER)
#define SLI_CPC_SYSVIEW_ON_ENDPOINT_RXD_REJECT_OUT_OF_MEMORY_EVENT_ID           (SLI_CPC_SYSVIEW_ON_ENDPOINT_RXD_REJECT_OUT_OF_MEMORY_EVENT_MARKER + CPC_ENDPOINT_EVENT_ID_OFFSET)
#define SLI_CPC_SYSVIEW_ON_ENDPOINT_RXD_REJECT_OUT_OF_MEMORY_EVENT_MESSAGE      ON_ENDPOINT_STR_MESSAGE("Received reject with out of memory", SLI_CPC_SYSVIEW_ON_ENDPOINT_RXD_REJECT_OUT_OF_MEMORY_EVENT_NBR, CPC_ENDPOINT_EVENT_ID_MULTIPLIER)

#define SLI_CPC_SYSVIEW_ON_ENDPOINT_RXD_REJECT_SECURITY_ISSUE_EVENT_NBR         21
#define SLI_CPC_SYSVIEW_ON_ENDPOINT_RXD_REJECT_SECURITY_ISSUE_EVENT_MARKER      (SLI_CPC_SYSVIEW_ON_ENDPOINT_RXD_REJECT_SECURITY_ISSUE_EVENT_NBR * CPC_ENDPOINT_EVENT_ID_MULTIPLIER)
#define SLI_CPC_SYSVIEW_ON_ENDPOINT_RXD_REJECT_SECURITY_ISSUE_EVENT_ID          (SLI_CPC_SYSVIEW_ON_ENDPOINT_RXD_REJECT_SECURITY_ISSUE_EVENT_MARKER + CPC_ENDPOINT_EVENT_ID_OFFSET)
#define SLI_CPC_SYSVIEW_ON_ENDPOINT_RXD_REJECT_SECURITY_ISSUE_EVENT_MESSAGE     ON_ENDPOINT_STR_MESSAGE("Received reject with security issue", SLI_CPC_SYSVIEW_ON_ENDPOINT_RXD_REJECT_SECURITY_ISSUE_EVENT_NBR, CPC_ENDPOINT_EVENT_ID_MULTIPLIER)

#define SLI_CPC_SYSVIEW_ON_ENDPOINT_RXD_REJECT_DESTINATION_UNREACHABLE_EVENT_NBR        22
#define SLI_CPC_SYSVIEW_ON_ENDPOINT_RXD_REJECT_DESTINATION_UNREACHABLE_EVENT_MARKER     (SLI_CPC_SYSVIEW_ON_ENDPOINT_RXD_REJECT_DESTINATION_UNREACHABLE_EVENT_NBR * CPC_ENDPOINT_EVENT_ID_MULTIPLIER)
#define SLI_CPC_SYSVIEW_ON_ENDPOINT_RXD_REJECT_DESTINATION_UNREACHABLE_EVENT_ID         (SLI_CPC_SYSVIEW_ON_ENDPOINT_RXD_REJECT_DESTINATION_UNREACHABLE_EVENT_MARKER + CPC_ENDPOINT_EVENT_ID_OFFSET)
#define SLI_CPC_SYSVIEW_ON_ENDPOINT_RXD_REJECT_DESTINATION_UNREACHABLE_EVENT_MESSAGE    ON_ENDPOINT_STR_MESSAGE("Received reject with destination unreachable", SLI_CPC_SYSVIEW_ON_ENDPOINT_RXD_REJECT_DESTINATION_UNREACHABLE_EVENT_NBR, CPC_ENDPOINT_EVENT_ID_MULTIPLIER)

#define SLI_CPC_SYSVIEW_ON_ENDPOINT_RXD_REJECT_FAULT_EVENT_NBR                  23
#define SLI_CPC_SYSVIEW_ON_ENDPOINT_RXD_REJECT_FAULT_EVENT_MARKER               (SLI_CPC_SYSVIEW_ON_ENDPOINT_RXD_REJECT_FAULT_EVENT_NBR * CPC_ENDPOINT_EVENT_ID_MULTIPLIER)
#define SLI_CPC_SYSVIEW_ON_ENDPOINT_RXD_REJECT_FAULT_EVENT_ID                   (SLI_CPC_SYSVIEW_ON_ENDPOINT_RXD_REJECT_FAULT_EVENT_MARKER + CPC_ENDPOINT_EVENT_ID_OFFSET)
#define SLI_CPC_SYSVIEW_ON_ENDPOINT_RXD_REJECT_FAULT_EVENT_MESSAGE              ON_ENDPOINT_STR_MESSAGE("Received reject with fault", SLI_CPC_SYSVIEW_ON_ENDPOINT_RXD_REJECT_FAULT_EVENT_NBR, CPC_ENDPOINT_EVENT_ID_MULTIPLIER)

#define SLI_CPC_SYSVIEW_ON_ENDPOINT_RXD_SUPERVISORY_DROPPED_EVENT_NBR           24
#define SLI_CPC_SYSVIEW_ON_ENDPOINT_RXD_SUPERVISORY_DROPPED_EVENT_MARKER        (SLI_CPC_SYSVIEW_ON_ENDPOINT_RXD_SUPERVISORY_DROPPED_EVENT_NBR * CPC_ENDPOINT_EVENT_ID_MULTIPLIER)
#define SLI_CPC_SYSVIEW_ON_ENDPOINT_RXD_SUPERVISORY_DROPPED_EVENT_ID            (SLI_CPC_SYSVIEW_ON_ENDPOINT_RXD_SUPERVISORY_DROPPED_EVENT_MARKER + CPC_ENDPOINT_EVENT_ID_OFFSET)
#define SLI_CPC_SYSVIEW_ON_ENDPOINT_RXD_SUPERVISORY_DROPPED_EVENT_MESSAGE       ON_ENDPOINT_STR_MESSAGE("Dropped supervisory frame", SLI_CPC_SYSVIEW_ON_ENDPOINT_RXD_SUPERVISORY_DROPPED_EVENT_NBR, CPC_ENDPOINT_EVENT_ID_MULTIPLIER)

