espressif/esp-matter/connectedhomeip/connectedhomeip/third_party/openthread/ot-efr32/third_party/silabs/gecko_sdk/platform/service/cpc/inc/sli_cpc_debug.h
#define SLI_CPC_SYSVIEW_ON_ENDPOINT_RXD_ACK_EVENT_NBR                           26
#define SLI_CPC_SYSVIEW_ON_ENDPOINT_RXD_ACK_EVENT_MARKER                        (SLI_CPC_SYSVIEW_ON_ENDPOINT_RXD_ACK_EVENT_NBR * CPC_ENDPOINT_EVENT_ID_MULTIPLIER)
#define SLI_CPC_SYSVIEW_ON_ENDPOINT_RXD_ACK_EVENT_ID                            (SLI_CPC_SYSVIEW_ON_ENDPOINT_RXD_ACK_EVENT_MARKER + CPC_ENDPOINT_EVENT_ID_OFFSET)
#define SLI_CPC_SYSVIEW_ON_ENDPOINT_RXD_ACK_EVENT_MESSAGE                       ON_ENDPOINT_STR_MESSAGE("Received ack", SLI_CPC_SYSVIEW_ON_ENDPOINT_RXD_ACK_EVENT_NBR, CPC_ENDPOINT_EVENT_ID_MULTIPLIER)

#define SLI_CPC_SYSVIEW_ON_ENDPOINT_TXD_ACK_EVENT_NBR                           28
#define SLI_CPC_SYSVIEW_ON_ENDPOINT_TXD_ACK_EVENT_MARKER                        (SLI_CPC_SYSVIEW_ON_ENDPOINT_TXD_ACK_EVENT_NBR * CPC_ENDPOINT_EVENT_ID_MULTIPLIER)
#define SLI_CPC_SYSVIEW_ON_ENDPOINT_TXD_ACK_EVENT_ID                            (SLI_CPC_SYSVIEW_ON_ENDPOINT_TXD_ACK_EVENT_MARKER + CPC_ENDPOINT_EVENT_ID_OFFSET)
#define SLI_CPC_SYSVIEW_ON_ENDPOINT_TXD_ACK_EVENT_MESSAGE                       ON_ENDPOINT_STR_MESSAGE("Transmitted ack", SLI_CPC_SYSVIEW_ON_ENDPOINT_TXD_ACK_EVENT_NBR, CPC_ENDPOINT_EVENT_ID_MULTIPLIER)

#define SLI_CPC_SYSVIEW_ON_ENDPOINT_RETXD_DATA_FRAME_EVENT_NBR                  29
#define SLI_CPC_SYSVIEW_ON_ENDPOINT_RETXD_DATA_FRAME_EVENT_MARKER               (SLI_CPC_SYSVIEW_ON_ENDPOINT_RETXD_DATA_FRAME_EVENT_NBR * CPC_ENDPOINT_EVENT_ID_MULTIPLIER)
#define SLI_CPC_SYSVIEW_ON_ENDPOINT_RETXD_DATA_FRAME_EVENT_ID                   (SLI_CPC_SYSVIEW_ON_ENDPOINT_RETXD_DATA_FRAME_EVENT_MARKER + CPC_ENDPOINT_EVENT_ID_OFFSET)
#define SLI_CPC_SYSVIEW_ON_ENDPOINT_RETXD_DATA_FRAME_EVENT_MESSAGE              ON_ENDPOINT_STR_MESSAGE("Retransmitted data frame", SLI_CPC_SYSVIEW_ON_ENDPOINT_RETXD_DATA_FRAME_EVENT_NBR, CPC_ENDPOINT_EVENT_ID_MULTIPLIER)

#define SLI_CPC_SYSVIEW_ON_ENDPOINT_TXD_REJECT_CHECSUM_MISMATCH_EVENT_NBR       30
#define SLI_CPC_SYSVIEW_ON_ENDPOINT_TXD_REJECT_CHECSUM_MISMATCH_EVENT_MARKER    (SLI_CPC_SYSVIEW_ON_ENDPOINT_TXD_REJECT_CHECSUM_MISMATCH_EVENT_NBR * CPC_ENDPOINT_EVENT_ID_MULTIPLIER)
#define SLI_CPC_SYSVIEW_ON_ENDPOINT_TXD_REJECT_CHECSUM_MISMATCH_EVENT_ID        (SLI_CPC_SYSVIEW_ON_ENDPOINT_TXD_REJECT_CHECSUM_MISMATCH_EVENT_MARKER + CPC_ENDPOINT_EVENT_ID_OFFSET)
#define SLI_CPC_SYSVIEW_ON_ENDPOINT_TXD_REJECT_CHECSUM_MISMATCH_EVENT_MESSAGE   ON_ENDPOINT_STR_MESSAGE("Transmitted reject with checksum mismatch", SLI_CPC_SYSVIEW_ON_ENDPOINT_TXD_REJECT_CHECSUM_MISMATCH_EVENT_NBR, CPC_ENDPOINT_EVENT_ID_MULTIPLIER)

#define SLI_CPC_SYSVIEW_ON_ENDPOINT_TXD_REJECT_SEQ_MISMATCH_EVENT_NBR           31
#define SLI_CPC_SYSVIEW_ON_ENDPOINT_TXD_REJECT_SEQ_MISMATCH_EVENT_MARKER        (SLI_CPC_SYSVIEW_ON_ENDPOINT_TXD_REJECT_SEQ_MISMATCH_EVENT_NBR * CPC_ENDPOINT_EVENT_ID_MULTIPLIER)
#define SLI_CPC_SYSVIEW_ON_ENDPOINT_TXD_REJECT_SEQ_MISMATCH_EVENT_ID            (SLI_CPC_SYSVIEW_ON_ENDPOINT_TXD_REJECT_SEQ_MISMATCH_EVENT_MARKER + CPC_ENDPOINT_EVENT_ID_OFFSET)
#define SLI_CPC_SYSVIEW_ON_ENDPOINT_TXD_REJECT_SEQ_MISMATCH_EVENT_MESSAGE       ON_ENDPOINT_STR_MESSAGE("Transmitted reject with sequence mismatch", SLI_CPC_SYSVIEW_ON_ENDPOINT_TXD_REJECT_SEQ_MISMATCH_EVENT_NBR, CPC_ENDPOINT_EVENT_ID_MULTIPLIER)

#define SLI_CPC_SYSVIEW_ON_ENDPOINT_TXD_REJECT_OUT_OF_MEMORY_EVENT_NBR          32
#define SLI_CPC_SYSVIEW_ON_ENDPOINT_TXD_REJECT_OUT_OF_MEMORY_EVENT_MARKER       (SLI_CPC_SYSVIEW_ON_ENDPOINT_TXD_REJECT_OUT_OF_MEMORY_EVENT_NBR * CPC_ENDPOINT_EVENT_ID_MULTIPLIER)
#define SLI_CPC_SYSVIEW_ON_ENDPOINT_TXD_REJECT_OUT_OF_MEMORY_EVENT_ID           (SLI_CPC_SYSVIEW_ON_ENDPOINT_TXD_REJECT_OUT_OF_MEMORY_EVENT_MARKER + CPC_ENDPOINT_EVENT_ID_OFFSET)
#define SLI_CPC_SYSVIEW_ON_ENDPOINT_TXD_REJECT_OUT_OF_MEMORY_EVENT_MESSAGE      ON_ENDPOINT_STR_MESSAGE("Transmitted reject with out of memory", SLI_CPC_SYSVIEW_ON_ENDPOINT_TXD_REJECT_OUT_OF_MEMORY_EVENT_NBR, CPC_ENDPOINT_EVENT_ID_MULTIPLIER)

#define SLI_CPC_SYSVIEW_ON_ENDPOINT_TXD_REJECT_SECURITY_ISSUE_EVENT_NBR         33
#define SLI_CPC_SYSVIEW_ON_ENDPOINT_TXD_REJECT_SECURITY_ISSUE_EVENT_MARKER      (SLI_CPC_SYSVIEW_ON_ENDPOINT_TXD_REJECT_SECURITY_ISSUE_EVENT_NBR * CPC_ENDPOINT_EVENT_ID_MULTIPLIER)
#define SLI_CPC_SYSVIEW_ON_ENDPOINT_TXD_REJECT_SECURITY_ISSUE_EVENT_ID          (SLI_CPC_SYSVIEW_ON_ENDPOINT_TXD_REJECT_SECURITY_ISSUE_EVENT_MARKER + CPC_ENDPOINT_EVENT_ID_OFFSET)
#define SLI_CPC_SYSVIEW_ON_ENDPOINT_TXD_REJECT_SECURITY_ISSUE_EVENT_MESSAGE     ON_ENDPOINT_STR_MESSAGE("Transmitted reject with security issue", SLI_CPC_SYSVIEW_ON_ENDPOINT_TXD_REJECT_SECURITY_ISSUE_EVENT_NBR, CPC_ENDPOINT_EVENT_ID_MULTIPLIER)

#define SLI_CPC_SYSVIEW_ON_ENDPOINT_TXD_REJECT_FAULT_EVENT_NBR                  34
#define SLI_CPC_SYSVIEW_ON_ENDPOINT_TXD_REJECT_FAULT_EVENT_MARKER               (SLI_CPC_SYSVIEW_ON_ENDPOINT_TXD_REJECT_FAULT_EVENT_NBR * CPC_ENDPOINT_EVENT_ID_MULTIPLIER)
#define SLI_CPC_SYSVIEW_ON_ENDPOINT_TXD_REJECT_FAULT_EVENT_ID                   (SLI_CPC_SYSVIEW_ON_ENDPOINT_TXD_REJECT_FAULT_EVENT_MARKER + CPC_ENDPOINT_EVENT_ID_OFFSET)
#define SLI_CPC_SYSVIEW_ON_ENDPOINT_TXD_REJECT_FAULT_EVENT_MESSAGE              ON_ENDPOINT_STR_MESSAGE("Transmitted reject with fault", SLI_CPC_SYSVIEW_ON_ENDPOINT_TXD_REJECT_FAULT_EVENT_NBR, CPC_ENDPOINT_EVENT_ID_MULTIPLIER)

#define SLI_CPC_SYSVIEW_ON_ENDPOINT_RXD_DATA_FRAME_QUEUED_EVENT_NBR             35
#define SLI_CPC_SYSVIEW_ON_ENDPOINT_RXD_DATA_FRAME_QUEUED_EVENT_MARKER          (SLI_CPC_SYSVIEW_ON_ENDPOINT_RXD_DATA_FRAME_QUEUED_EVENT_NBR * CPC_ENDPOINT_EVENT_ID_MULTIPLIER)
#define SLI_CPC_SYSVIEW_ON_ENDPOINT_RXD_DATA_FRAME_QUEUED_EVENT_ID              (SLI_CPC_SYSVIEW_ON_ENDPOINT_RXD_DATA_FRAME_QUEUED_EVENT_MARKER + CPC_ENDPOINT_EVENT_ID_OFFSET)
#define SLI_CPC_SYSVIEW_ON_ENDPOINT_RXD_DATA_FRAME_QUEUED_EVENT_MESSAGE         ON_ENDPOINT_STR_MESSAGE("Received data has been push to endpoint's receive queue", SLI_CPC_SYSVIEW_ON_ENDPOINT_RXD_DATA_FRAME_QUEUED_EVENT_NBR, CPC_ENDPOINT_EVENT_ID_MULTIPLIER)

#define SLI_CPC_SYSVIEW_ON_ENDPOINT_FRAME_TRANSMIT_SUBMITTED_NBR                36
#define SLI_CPC_SYSVIEW_ON_ENDPOINT_FRAME_TRANSMIT_SUBMITTED_EVENT_MARKER       (SLI_CPC_SYSVIEW_ON_ENDPOINT_FRAME_TRANSMIT_SUBMITTED_NBR * CPC_ENDPOINT_EVENT_ID_MULTIPLIER)
#define SLI_CPC_SYSVIEW_ON_ENDPOINT_FRAME_TRANSMIT_SUBMITTED_EVENT_ID           (SLI_CPC_SYSVIEW_ON_ENDPOINT_FRAME_TRANSMIT_SUBMITTED_EVENT_MARKER + CPC_ENDPOINT_EVENT_ID_OFFSET)
#define SLI_CPC_SYSVIEW_ON_ENDPOINT_FRAME_TRANSMIT_SUBMITTED_EVENT_MESSAGE      ON_ENDPOINT_STR_MESSAGE("Transmit completed", SLI_CPC_SYSVIEW_ON_ENDPOINT_FRAME_TRANSMIT_SUBMITTED_NBR, CPC_ENDPOINT_EVENT_ID_MULTIPLIER)

#define SLI_CPC_SYSVIEW_ON_ENDPOINT_RXD_DATA_FRAME_DROPPED_EVENT_NBR             37
#define SLI_CPC_SYSVIEW_ON_ENDPOINT_RXD_DATA_FRAME_DROPPED_EVENT_MARKER          (SLI_CPC_SYSVIEW_ON_ENDPOINT_RXD_DATA_FRAME_DROPPED_EVENT_NBR * CPC_ENDPOINT_EVENT_ID_MULTIPLIER)
#define SLI_CPC_SYSVIEW_ON_ENDPOINT_RXD_DATA_FRAME_DROPPED_EVENT_ID              (SLI_CPC_SYSVIEW_ON_ENDPOINT_RXD_DATA_FRAME_DROPPED_EVENT_MARKER + CPC_ENDPOINT_EVENT_ID_OFFSET)
#define SLI_CPC_SYSVIEW_ON_ENDPOINT_RXD_DATA_FRAME_DROPPED_EVENT_MESSAGE         ON_ENDPOINT_STR_MESSAGE("Received data has been dropped", SLI_CPC_SYSVIEW_ON_ENDPOINT_RXD_DATA_FRAME_DROPPED_EVENT_NBR, CPC_ENDPOINT_EVENT_ID_MULTIPLIER)

#endif // SLI_CPC_DEBUG_H
